read_verilog src/arm_core.v
synth_xilinx -top arm_core
write_verilog arm_core_netlist.v
